{"config": {"output_layers": [["output_headline_vector", 0, 0]], "name": "model_6", "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "sentence_vectors", "batch_input_shape": [null, 35, 300]}, "name": "sentence_vectors", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "name": "conv1d_8", "kernel_constraint": null, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3], "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true}, "name": "conv1d_8", "class_name": "Conv1D", "inbound_nodes": [[["sentence_vectors", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_7", "rate": 0.5}, "name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["conv1d_8", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "conv1d_9", "kernel_constraint": null, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true}, "name": "conv1d_9", "class_name": "Conv1D", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_8", "rate": 0.5}, "name": "dropout_8", "class_name": "Dropout", "inbound_nodes": [[["conv1d_9", 0, 0, {}]]]}, {"config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_7", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "sa1"}, "name": "sa1", "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "sa2"}, "name": "sa2", "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "sa3"}, "name": "sa3", "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "sa4"}, "name": "sa4", "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"sparse": false, "dtype": "float32", "name": "input_headline_vector", "batch_input_shape": [null, 300]}, "name": "input_headline_vector", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "name": "concatenate_3", "class_name": "Concatenate", "inbound_nodes": [[["sa1", 0, 0, {}], ["sa2", 0, 0, {}], ["sa3", 0, 0, {}], ["sa4", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "dense_3", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 256}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["input_headline_vector", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "conv1d_10", "kernel_constraint": null, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true}, "name": "conv1d_10", "class_name": "Conv1D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"config": {"name": "lambda_2", "output_shape": null, "arguments": {}, "trainable": true, "function_type": "lambda", "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxMAAAB0AABqAQB8AABkAQBkAgCDAQFTKQNO2gRheGlz6QEA\nAAApAtoBS9oLZXhwYW5kX2RpbXMpAdoBeKkAcgYAAAD6HzxpcHl0aG9uLWlucHV0LTQ1LWJjN2M2\nNzE5MzFhYT7aCDxsYW1iZGE+EgAAAHMAAAAA\n", null, null]}, "name": "lambda_2", "class_name": "Lambda", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_9", "rate": 0.5}, "name": "dropout_9", "class_name": "Dropout", "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_9", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_8", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "ca1"}, "name": "ca1", "class_name": "CrossAttention", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "ca2"}, "name": "ca2", "class_name": "CrossAttention", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "ca3"}, "name": "ca3", "class_name": "CrossAttention", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "ca4"}, "name": "ca4", "class_name": "CrossAttention", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]]}, {"config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "name": "concatenate_4", "class_name": "Concatenate", "inbound_nodes": [[["ca1", 0, 0, {}], ["ca2", 0, 0, {}], ["ca3", 0, 0, {}], ["ca4", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_10", "rate": 0.5}, "name": "dropout_10", "class_name": "Dropout", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_10", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "conv1d_11", "kernel_constraint": null, "strides": [2], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true}, "name": "conv1d_11", "class_name": "Conv1D", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "conv1d_12", "kernel_constraint": null, "strides": [2], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true}, "name": "conv1d_12", "class_name": "Conv1D", "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "conv1d_13", "kernel_constraint": null, "strides": [2], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true}, "name": "conv1d_13", "class_name": "Conv1D", "inbound_nodes": [[["conv1d_12", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "conv1d_14", "kernel_constraint": null, "strides": [2], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true}, "name": "conv1d_14", "class_name": "Conv1D", "inbound_nodes": [[["conv1d_13", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_11", "rate": 0.5}, "name": "dropout_11", "class_name": "Dropout", "inbound_nodes": [[["conv1d_14", 0, 0, {}]]]}, {"config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_11", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "global_average_pooling1d_2"}, "name": "global_average_pooling1d_2", "class_name": "GlobalAveragePooling1D", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "dense_4", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["global_average_pooling1d_2", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_12", "rate": 0.5}, "name": "dropout_12", "class_name": "Dropout", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"config": {"center": true, "epsilon": 0.001, "name": "batch_normalization_12", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "name": "output_headline_vector", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 300}, "name": "output_headline_vector", "class_name": "Dense", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}], "input_layers": [["sentence_vectors", 0, 0], ["input_headline_vector", 0, 0]]}, "keras_version": "2.2.2", "class_name": "Model", "backend": "tensorflow"}